# IdeaStatiCa.RcsApi.Model.Pin
Pin

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Name** | **string** | Name of pin | [optional]
**Material** | **ReferenceElement** |  | [optional]
**Diameter** | **double** | Pin diameter | [optional]
**HoleDiameter** | **double** | Size of hole Diameter | [optional]
**HasPinCap** | **bool** | Has Pin Cap | [optional]
**PinCapDiameter** | **double** | Pin Cap Diameter | [optional]
**PinCapThickness** | **double** | Thickness of Pin Cap | [optional]
**PinOverlap** | **double** | Pin Overlap | [optional]
**LoadFromLibrary** | **bool** | Load from library - try override properties from library find Pin by name | [optional]
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)